Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/employment_support_schemes/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Schemes to support employment Overview of the employment schemes and other supports which encourage people getting unemployment and certain other social welfare payments to take up employment
ga: Overview Document Scéimeanna chun tacú le fostaíocht Forbhreathnú ar na scéimeanna fostaíochta agus ar na tacaíochtaí eile a spreagann daoine a bhfuil íocaíocht dífhostaíochta nó íocaíochtaí leasa shóisialaigh áirithe eile á fháil acu chun fostaíocht a ghlacadh

source: Community Employment helps people get back to work by offering part-time placements in jobs based within local communities
ga: Tugann an Scéim Fhostaíochta Pobail cabhair do dhaoine chun dul ar ais ag obair. Cuireann an scéim socrúcháin páirtaimseartha ar fáil i jabanna pobail áitiúla

source: Tús is a community work placement scheme for unemployed people who are selected to participate by the Department of Social Protection
ga: Is tionscnamh socrúcháin oibre phobail é Tús do dhaoine dífhostaithe. Roghnaíonn an Roinn Coimirce Sóisialaí iad chuig rannpháirtíocht sa scéim

source: Gateway is a local authority work opportunities scheme for unemployed people who are selected for participation by the Department of Social Protection
ga: Is scéim deiseanna oibre údaráis áitiúil é Gateway do dhaoine dífhostaithe. Roghnaíonn an Roinn Coimirce Sóisialaí iad chuig rannpháirtíocht sa scéim

source: The Programme supports community businesses to provide local services to their communities and to provide employment to unemployed people
ga: Cabhraíonn an Clár le gnólachtaí pobail chun seirbhísí áitiúla dá bpobail agus fostaíocht do dhaoine dífhostaithe a chur ar fáil

source: JobBridge, the National Internship scheme provides work experience opportunities for unemployed people
ga: Soláthraíonn Scéim Náisiúnta Intéirneachta deiseanna thaithí oibre do dhaoine dífhostaithe

source: The Work Placement Programme provides work experience for unemployed people
ga: Cuireann Clár Socrúcháin Oibre taithí oibre ar fáil do dhaoine dífhostaithe

source: JobsPlus is a new incentive to encourage employers to employ long-term unemployed people
ga: Tionscnamh nua atá in JobsPlus atá in ainm is fostóirí a spreagadh chun daoine atá dífhostaithe le fada a fhostú

source: The incentive is paid monthly in arrears, over a 2-year period
ga: Tá an dreasacht seo iníoctha gach mí i riaráistí, thar thréimhse 2 bhliain

source: Revenue Job Assist is an additional tax allowance for people who have been unemployed for 12 months or more and are returning to employment
ga: Is faoiseamh breise cánach é Postchúnamh Ioncaim do dhaoine a bhí dífhostaithe ar feadh 12 mhí nó níos mó agus atá ag filleadh ar fhostaíocht

source: Job Initiative is a scheme providing full-time work to long-term unemployed people
ga: Scéim Tionscnamh Jabanna a chuireann fostaíocht lánaimsire ar fáil do dhaoine atá dífhostaithe go fadtéarmach

source: The Rural Social Scheme (RSS) provides income support for farmers and fishermen/women who are getting certain social welfare payments
ga: Is í aidhm na scéime Sóisialta Tuaithe ná fordheontas ioncaim a sholáthar d'fheirmeoirí agus iascairí in Éirinn atá ag fáil íocaíochtaí leasa shóisialaigh ar bhonn fadtéarmach

source: This document is in: Social Welfare > Social welfare payments > Farming and fishing
ga: This document is in: Leas Sóisialach > Íocaíochtaí Leasa Shóisialaigh > Feirmeoireacht agus iascaireacht

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Cáin agus tosú ar obair
